#Installing Pyspark in Googlecolab

In [1]:
!pip install pyspark py4j

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting pyspark
  Downloading pyspark-3.3.1.tar.gz (281.4 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 281.4/281.4 MB 5.0 MB/s eta 0:00:00
  Preparing metadata (setup.py) ... done
Collecting py4j
  Downloading py4j-0.10.9.7-py2.py3-none-any.whl (200 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 200.5/200.5 KB 20.7 MB/s eta 0:00:00
  Downloading py4j-0.10.9.5-py2.py3-none-any.whl (199 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 199.7/199.7 KB 22.4 MB/s eta 0:00:00
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.3.1-py2.py3-none-any.whl size=281845512 sha256=a06e2b73e2cd389b537845a48bbf459a76ecf1e796f5df9211f632217bf1c7b0
  Stored in directory: /root/.cache/pip/wheels/43/dc/11/ec201cd671da62fa9c5cc77078235e40722170ceba231d7598
Successfully built pyspark
Installing collected packages: py4j, pyspark
Successfully installed py4j-0.10.9.5 pyspark-3.3.1

# Creating new SparkSession

In [2]:
from pyspark.sql import SparkSession

spark = SparkSession.builder.appName("Practice").getOrCreate()

In [3]:
spark

#Reading CSV data into df dataframe without header and schema

In [17]:
df = spark.read.format('csv').load("/content/sample_data/california_housing_test.csv")
df.show(10)

+-----------+---------+------------------+-----------+--------------+-----------+----------+-------------+------------------+
|        _c0|      _c1|               _c2|        _c3|           _c4|        _c5|       _c6|          _c7|               _c8|
+-----------+---------+------------------+-----------+--------------+-----------+----------+-------------+------------------+
|  longitude| latitude|housing_median_age|total_rooms|total_bedrooms| population|households|median_income|median_house_value|
|-122.050000|37.370000|         27.000000|3885.000000|    661.000000|1537.000000|606.000000|     6.608500|     344700.000000|
|-118.300000|34.260000|         43.000000|1510.000000|    310.000000| 809.000000|277.000000|     3.599000|     176500.000000|
|-117.810000|33.780000|         27.000000|3589.000000|    507.000000|1484.000000|495.000000|     5.793400|     270500.000000|
|-118.360000|33.820000|         28.000000|  67.000000|     15.000000|  49.000000| 11.000000|     6.135900|     330000.000000|
|-119.670000|36.330000|         19.000000|1241.000000|    244.000000| 850.000000|237.000000|     2.937500|      81700.000000|
|-119.560000|36.510000|         37.000000|1018.000000|    213.000000| 663.000000|204.000000|     1.663500|      67000.000000|
|-121.430000|38.630000|         43.000000|1009.000000|    225.000000| 604.000000|218.000000|     1.664100|      67000.000000|
|-120.650000|35.480000|         19.000000|2310.000000|    471.000000|1341.000000|441.000000|     3.225000|     166900.000000|
|-122.840000|38.400000|         15.000000|3080.000000|    617.000000|1446.000000|599.000000|     3.669600|     194400.000000|
+-----------+---------+------------------+-----------+--------------+-----------+----------+-------------+------------------+
only showing top 10 rows

In [9]:
df.printSchema()
type(df)

root
 |-- _c0: string (nullable = true)
 |-- _c1: string (nullable = true)
 |-- _c2: string (nullable = true)
 |-- _c3: string (nullable = true)
 |-- _c4: string (nullable = true)
 |-- _c5: string (nullable = true)
 |-- _c6: string (nullable = true)
 |-- _c7: string (nullable = true)
 |-- _c8: string (nullable = true)

pyspark.sql.dataframe.DataFrame

# Reading csv data into df1 dataframe with Header and schema

In [16]:
df1 = spark.read.format('csv').option('header','true').option('inferSchema','true').load("/content/sample_data/california_housing_test.csv")
df1.show(10)

+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+
|longitude|latitude|housing_median_age|total_rooms|total_bedrooms|population|households|median_income|median_house_value|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+
|  -122.05|   37.37|              27.0|     3885.0|         661.0|    1537.0|     606.0|       6.6085|          344700.0|
|   -118.3|   34.26|              43.0|     1510.0|         310.0|     809.0|     277.0|        3.599|          176500.0|
|  -117.81|   33.78|              27.0|     3589.0|         507.0|    1484.0|     495.0|       5.7934|          270500.0|
|  -118.36|   33.82|              28.0|       67.0|          15.0|      49.0|      11.0|       6.1359|          330000.0|
|  -119.67|   36.33|              19.0|     1241.0|         244.0|     850.0|     237.0|       2.9375|           81700.0|
|  -119.56|   36.51|              37.0|     1018.0|         213.0|     663.0|     204.0|       1.6635|           67000.0|
|  -121.43|   38.63|              43.0|     1009.0|         225.0|     604.0|     218.0|       1.6641|           67000.0|
|  -120.65|   35.48|              19.0|     2310.0|         471.0|    1341.0|     441.0|        3.225|          166900.0|
|  -122.84|    38.4|              15.0|     3080.0|         617.0|    1446.0|     599.0|       3.6696|          194400.0|
|  -118.02|   34.08|              31.0|     2402.0|         632.0|    2830.0|     603.0|       2.3333|          164200.0|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+
only showing top 10 rows

In [20]:
df1.printSchema()
print(type(df1))
df1.count()

root
 |-- longitude: double (nullable = true)
 |-- latitude: double (nullable = true)
 |-- housing_median_age: double (nullable = true)
 |-- total_rooms: double (nullable = true)
 |-- total_bedrooms: double (nullable = true)
 |-- population: double (nullable = true)
 |-- households: double (nullable = true)
 |-- median_income: double (nullable = true)
 |-- median_house_value: double (nullable = true)

<class 'pyspark.sql.dataframe.DataFrame'>

3000

# Reading csv data into df2 dataframe with Header and schema- (another way)

In [27]:
df2= spark.read.csv("/content/sample_data/california_housing_test.csv",header=True,inferSchema=True)
df2.show(10)

+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+
|longitude|latitude|housing_median_age|total_rooms|total_bedrooms|population|households|median_income|median_house_value|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+
|  -122.05|   37.37|              27.0|     3885.0|         661.0|    1537.0|     606.0|       6.6085|          344700.0|
|   -118.3|   34.26|              43.0|     1510.0|         310.0|     809.0|     277.0|        3.599|          176500.0|
|  -117.81|   33.78|              27.0|     3589.0|         507.0|    1484.0|     495.0|       5.7934|          270500.0|
|  -118.36|   33.82|              28.0|       67.0|          15.0|      49.0|      11.0|       6.1359|          330000.0|
|  -119.67|   36.33|              19.0|     1241.0|         244.0|     850.0|     237.0|       2.9375|           81700.0|
|  -119.56|   36.51|              37.0|     1018.0|         213.0|     663.0|     204.0|       1.6635|           67000.0|
|  -121.43|   38.63|              43.0|     1009.0|         225.0|     604.0|     218.0|       1.6641|           67000.0|
|  -120.65|   35.48|              19.0|     2310.0|         471.0|    1341.0|     441.0|        3.225|          166900.0|
|  -122.84|    38.4|              15.0|     3080.0|         617.0|    1446.0|     599.0|       3.6696|          194400.0|
|  -118.02|   34.08|              31.0|     2402.0|         632.0|    2830.0|     603.0|       2.3333|          164200.0|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+
only showing top 10 rows

In [29]:
df2.printSchema()
print(type(df2))
df2.count()

root
 |-- longitude: double (nullable = true)
 |-- latitude: double (nullable = true)
 |-- housing_median_age: double (nullable = true)
 |-- total_rooms: double (nullable = true)
 |-- total_bedrooms: double (nullable = true)
 |-- population: double (nullable = true)
 |-- households: double (nullable = true)
 |-- median_income: double (nullable = true)
 |-- median_house_value: double (nullable = true)

<class 'pyspark.sql.dataframe.DataFrame'>

3000

# Top head values

In [30]:
df.head(5)

[Row(_c0='longitude', _c1='latitude', _c2='housing_median_age', _c3='total_rooms', _c4='total_bedrooms', _c5='population', _c6='households', _c7='median_income', _c8='median_house_value'),
 Row(_c0='-122.050000', _c1='37.370000', _c2='27.000000', _c3='3885.000000', _c4='661.000000', _c5='1537.000000', _c6='606.000000', _c7='6.608500', _c8='344700.000000'),
 Row(_c0='-118.300000', _c1='34.260000', _c2='43.000000', _c3='1510.000000', _c4='310.000000', _c5='809.000000', _c6='277.000000', _c7='3.599000', _c8='176500.000000'),
 Row(_c0='-117.810000', _c1='33.780000', _c2='27.000000', _c3='3589.000000', _c4='507.000000', _c5='1484.000000', _c6='495.000000', _c7='5.793400', _c8='270500.000000'),
 Row(_c0='-118.360000', _c1='33.820000', _c2='28.000000', _c3='67.000000', _c4='15.000000', _c5='49.000000', _c6='11.000000', _c7='6.135900', _c8='330000.000000')]

# Tails values

In [31]:
df2.tail(5)

[Row(longitude=-119.86, latitude=34.42, housing_median_age=23.0, total_rooms=1450.0, total_bedrooms=642.0, population=1258.0, households=607.0, median_income=1.179, median_house_value=225000.0),
 Row(longitude=-118.14, latitude=34.06, housing_median_age=27.0, total_rooms=5257.0, total_bedrooms=1082.0, population=3496.0, households=1036.0, median_income=3.3906, median_house_value=237200.0),
 Row(longitude=-119.7, latitude=36.3, housing_median_age=10.0, total_rooms=956.0, total_bedrooms=201.0, population=693.0, households=220.0, median_income=2.2895, median_house_value=62000.0),
 Row(longitude=-117.12, latitude=34.1, housing_median_age=40.0, total_rooms=96.0, total_bedrooms=14.0, population=46.0, households=14.0, median_income=3.2708, median_house_value=162500.0),
 Row(longitude=-119.63, latitude=34.42, housing_median_age=42.0, total_rooms=1765.0, total_bedrooms=263.0, population=753.0, households=260.0, median_income=8.5608, median_house_value=500001.0)]

# check columns

In [32]:
df2.columns

['longitude',
 'latitude',
 'housing_median_age',
 'total_rooms',
 'total_bedrooms',
 'population',
 'households',
 'median_income',
 'median_house_value']

# Select particular columns

In [33]:
df2.select('longitude').show()

+---------+
|longitude|
+---------+
|  -122.05|
|   -118.3|
|  -117.81|
|  -118.36|
|  -119.67|
|  -119.56|
|  -121.43|
|  -120.65|
|  -122.84|
|  -118.02|
|  -118.24|
|  -119.12|
|  -121.93|
|  -117.03|
|  -117.97|
|  -117.99|
|  -120.81|
|   -121.2|
|  -118.88|
|  -122.59|
+---------+
only showing top 20 rows

In [34]:
df2.select(['population','housing_median_age']).show()

+----------+------------------+
|population|housing_median_age|
+----------+------------------+
|    1537.0|              27.0|
|     809.0|              43.0|
|    1484.0|              27.0|
|      49.0|              28.0|
|     850.0|              19.0|
|     663.0|              37.0|
|     604.0|              43.0|
|    1341.0|              19.0|
|    1446.0|              15.0|
|    2830.0|              31.0|
|    1288.0|              45.0|
|     564.0|              37.0|
|     535.0|              36.0|
|    1935.0|              16.0|
|    1217.0|              27.0|
|     157.0|              42.0|
|     189.0|              15.0|
|    1603.0|              26.0|
|     654.0|              26.0|
|    3450.0|              35.0|
+----------+------------------+
only showing top 20 rows

# check data types of columns

In [35]:
df2.dtypes

[('longitude', 'double'),
 ('latitude', 'double'),
 ('housing_median_age', 'double'),
 ('total_rooms', 'double'),
 ('total_bedrooms', 'double'),
 ('population', 'double'),
 ('households', 'double'),
 ('median_income', 'double'),
 ('median_house_value', 'double')]

# describe function

In [36]:
df2.describe().show()

+-------+-------------------+------------------+------------------+-----------------+------------------+------------------+------------------+------------------+------------------+
|summary|          longitude|          latitude|housing_median_age|      total_rooms|    total_bedrooms|        population|        households|     median_income|median_house_value|
+-------+-------------------+------------------+------------------+-----------------+------------------+------------------+------------------+------------------+------------------+
|  count|               3000|              3000|              3000|             3000|              3000|              3000|              3000|              3000|              3000|
|   mean|-119.58920000000029| 35.63538999999999|28.845333333333333|2599.578666666667| 529.9506666666666|1402.7986666666666|           489.912| 3.807271799999998|        205846.275|
| stddev| 1.9949362939550166|2.1296695233438334|12.555395554955757|2155.593331625582|415.65436813632306|1030.5430124122424|365.42270980552615|1.8545117296914775|113119.68746964622|
|    min|            -124.18|             32.56|               1.0|              6.0|               2.0|               5.0|               2.0|            0.4999|           22500.0|
|    max|            -114.49|             41.92|              52.0|          30450.0|            5419.0|           11935.0|            4930.0|           15.0001|          500001.0|
+-------+-------------------+------------------+------------------+-----------------+------------------+------------------+------------------+------------------+------------------+

# Adding columns in dataframe

In [49]:
from pyspark.sql.functions import *
df3 = df2.withColumn('housing_age',col('housing_median_age')+10).withColumn('income',col('median_income')+10).withColumn('house_value',col('median_house_value')+10)

In [50]:
df3.show()

+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+-----------+------------------+-----------+
|longitude|latitude|housing_median_age|total_rooms|total_bedrooms|population|households|median_income|median_house_value|housing_age|            income|house_value|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+-----------+------------------+-----------+
|  -122.05|   37.37|              27.0|     3885.0|         661.0|    1537.0|     606.0|       6.6085|          344700.0|       37.0|           16.6085|   344710.0|
|   -118.3|   34.26|              43.0|     1510.0|         310.0|     809.0|     277.0|        3.599|          176500.0|       53.0|            13.599|   176510.0|
|  -117.81|   33.78|              27.0|     3589.0|         507.0|    1484.0|     495.0|       5.7934|          270500.0|       37.0|           15.7934|   270510.0|
|  -118.36|   33.82|              28.0|       67.0|          15.0|      49.0|      11.0|       6.1359|          330000.0|       38.0|           16.1359|   330010.0|
|  -119.67|   36.33|              19.0|     1241.0|         244.0|     850.0|     237.0|       2.9375|           81700.0|       29.0|           12.9375|    81710.0|
|  -119.56|   36.51|              37.0|     1018.0|         213.0|     663.0|     204.0|       1.6635|           67000.0|       47.0|11.663499999999999|    67010.0|
|  -121.43|   38.63|              43.0|     1009.0|         225.0|     604.0|     218.0|       1.6641|           67000.0|       53.0|           11.6641|    67010.0|
|  -120.65|   35.48|              19.0|     2310.0|         471.0|    1341.0|     441.0|        3.225|          166900.0|       29.0|            13.225|   166910.0|
|  -122.84|    38.4|              15.0|     3080.0|         617.0|    1446.0|     599.0|       3.6696|          194400.0|       25.0|13.669599999999999|   194410.0|
|  -118.02|   34.08|              31.0|     2402.0|         632.0|    2830.0|     603.0|       2.3333|          164200.0|       41.0|           12.3333|   164210.0|
|  -118.24|   33.98|              45.0|      972.0|         249.0|    1288.0|     261.0|       2.2054|          125000.0|       55.0|12.205400000000001|   125010.0|
|  -119.12|   35.85|              37.0|      736.0|         166.0|     564.0|     138.0|       2.4167|           58300.0|       47.0|           12.4167|    58310.0|
|  -121.93|   37.25|              36.0|     1089.0|         182.0|     535.0|     170.0|         4.69|          252600.0|       46.0|14.690000000000001|   252610.0|
|  -117.03|   32.97|              16.0|     3936.0|         694.0|    1935.0|     659.0|       4.5625|          231200.0|       26.0|           14.5625|   231210.0|
|  -117.97|   33.73|              27.0|     2097.0|         325.0|    1217.0|     331.0|       5.7121|          222500.0|       37.0|           15.7121|   222510.0|
|  -117.99|   33.81|              42.0|      161.0|          40.0|     157.0|      50.0|          2.2|          153100.0|       52.0|              12.2|   153110.0|
|  -120.81|   37.53|              15.0|      570.0|         123.0|     189.0|     107.0|        1.875|          181300.0|       25.0|            11.875|   181310.0|
|   -121.2|   38.69|              26.0|     3077.0|         607.0|    1603.0|     595.0|       2.7174|          137500.0|       36.0|           12.7174|   137510.0|
|  -118.88|   34.21|              26.0|     1590.0|         196.0|     654.0|     199.0|       6.5851|          300000.0|       36.0|           16.5851|   300010.0|
|  -122.59|   38.01|              35.0|     8814.0|        1307.0|    3450.0|    1258.0|       6.1724|          414300.0|       45.0|           16.1724|   414310.0|
+---------+--------+------------------+-----------+--------------+----------+----------+-------------+------------------+-----------+------------------+-----------+
only showing top 20 rows

# Dropping columns

In [52]:
df4=df3.drop('housing_median_age').drop('median_income').drop('median_house_value')
df4.show(10)

+---------+--------+-----------+--------------+----------+----------+-----------+------------------+-----------+
|longitude|latitude|total_rooms|total_bedrooms|population|households|housing_age|            income|house_value|
+---------+--------+-----------+--------------+----------+----------+-----------+------------------+-----------+
|  -122.05|   37.37|     3885.0|         661.0|    1537.0|     606.0|       37.0|           16.6085|   344710.0|
|   -118.3|   34.26|     1510.0|         310.0|     809.0|     277.0|       53.0|            13.599|   176510.0|
|  -117.81|   33.78|     3589.0|         507.0|    1484.0|     495.0|       37.0|           15.7934|   270510.0|
|  -118.36|   33.82|       67.0|          15.0|      49.0|      11.0|       38.0|           16.1359|   330010.0|
|  -119.67|   36.33|     1241.0|         244.0|     850.0|     237.0|       29.0|           12.9375|    81710.0|
|  -119.56|   36.51|     1018.0|         213.0|     663.0|     204.0|       47.0|11.663499999999999|    67010.0|
|  -121.43|   38.63|     1009.0|         225.0|     604.0|     218.0|       53.0|           11.6641|    67010.0|
|  -120.65|   35.48|     2310.0|         471.0|    1341.0|     441.0|       29.0|            13.225|   166910.0|
|  -122.84|    38.4|     3080.0|         617.0|    1446.0|     599.0|       25.0|13.669599999999999|   194410.0|
|  -118.02|   34.08|     2402.0|         632.0|    2830.0|     603.0|       41.0|           12.3333|   164210.0|
+---------+--------+-----------+--------------+----------+----------+-----------+------------------+-----------+
only showing top 10 rows

# rename columns

In [56]:
df5=df4.withColumnRenamed('income','Housing_Income').withColumnRenamed('housing_age','Housing_Age')
df5.show(10)

+---------+--------+-----------+--------------+----------+----------+-----------+------------------+-----------+
|longitude|latitude|total_rooms|total_bedrooms|population|households|Housing_Age|    Housing_Income|house_value|
+---------+--------+-----------+--------------+----------+----------+-----------+------------------+-----------+
|  -122.05|   37.37|     3885.0|         661.0|    1537.0|     606.0|       37.0|           16.6085|   344710.0|
|   -118.3|   34.26|     1510.0|         310.0|     809.0|     277.0|       53.0|            13.599|   176510.0|
|  -117.81|   33.78|     3589.0|         507.0|    1484.0|     495.0|       37.0|           15.7934|   270510.0|
|  -118.36|   33.82|       67.0|          15.0|      49.0|      11.0|       38.0|           16.1359|   330010.0|
|  -119.67|   36.33|     1241.0|         244.0|     850.0|     237.0|       29.0|           12.9375|    81710.0|
|  -119.56|   36.51|     1018.0|         213.0|     663.0|     204.0|       47.0|11.663499999999999|    67010.0|
|  -121.43|   38.63|     1009.0|         225.0|     604.0|     218.0|       53.0|           11.6641|    67010.0|
|  -120.65|   35.48|     2310.0|         471.0|    1341.0|     441.0|       29.0|            13.225|   166910.0|
|  -122.84|    38.4|     3080.0|         617.0|    1446.0|     599.0|       25.0|13.669599999999999|   194410.0|
|  -118.02|   34.08|     2402.0|         632.0|    2830.0|     603.0|       41.0|           12.3333|   164210.0|
+---------+--------+-----------+--------------+----------+----------+-----------+------------------+-----------+
only showing top 10 rows

#  Writing schema for dataFrame

In [86]:
from pyspark.sql.types import *

schema = StructType([StructField("EMPNO", IntegerType(), True),\
                     StructField("ENAME", StringType(), True),\
                     StructField("JOB", StringType(), True),\
                     StructField("MGR", IntegerType(), True),\
                     StructField("HIREDATE", DateType(), True),\
                     StructField("SAL", IntegerType(), True),\
                     StructField("COMM", IntegerType(), True),\
                     StructField("DEPTNO", IntegerType(), True),\
                     StructField("UPDATED_DATE",DateType(), True)\
])

# Reading csv dataframe with pipe seprated values

In [94]:
data = spark.read.format('csv').option('header',True).option('Sep','|').option('nullValue','null').option('inferSchema',True).load("/content/emp_pipe.csv")
data.show()

+-----+------+---------+----+--------+----+----+------+
|EMPNO| ENAME|      JOB| MGR|HIREDATE| SAL|COMM|DEPTNO|
+-----+------+---------+----+--------+----+----+------+
| 7369| SMITH|    CLERK|7902|17-12-80| 800|null|    20|
| 7499| ALLEN| SALESMAN|7698|20-02-81|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|22-02-81|1250| 500|    30|
| 7566| JONES|  MANAGER|7839|02-04-81|2975|null|    20|
| 7654|MARTIN| SALESMAN|7698|28-09-81|1250|1400|    30|
| 7698|   SGR|  MANAGER|7839|01-05-81|2850|null|    30|
| 7782|  RAVI|  MANAGER|7839|09-06-81|2450|null|    10|
| 7788| SCOTT|  ANALYST|7566|19-04-87|3000|null|    20|
| 7839|  KING|PRESIDENT|null|17-11-81|5000|null|    10|
| 7844|TURNER| SALESMAN|7698|08-09-81|1500|   0|    30|
| 7876| ADAMS|    CLERK|7788|23-05-87|1100|null|    20|
| 7900| JAMES|    CLERK|7698|03-12-81| 950|null|    30|
| 7902|  FORD|  ANALYST|7566|03-12-81|3000|null|    20|
| 7934|MILLER|    CLERK|7782|23-01-82|1300|null|    10|
| 1234|SEKHAR|   doctor|7777|    null| 667|  78|    80|
+-----+------+---------+----+--------+----+----+------+

In [96]:
data.printSchema()
data.count()

root
 |-- EMPNO: integer (nullable = true)
 |-- ENAME: string (nullable = true)
 |-- JOB: string (nullable = true)
 |-- MGR: integer (nullable = true)
 |-- HIREDATE: string (nullable = true)
 |-- SAL: integer (nullable = true)
 |-- COMM: integer (nullable = true)
 |-- DEPTNO: integer (nullable = true)

15

# drop null values from dataFrame

In [108]:
#  how = any

data2 = data.dropna(how='any')
data2.show()
data2.count()

+-----+------+--------+----+--------+----+----+------+
|EMPNO| ENAME|     JOB| MGR|HIREDATE| SAL|COMM|DEPTNO|
+-----+------+--------+----+--------+----+----+------+
| 7499| ALLEN|SALESMAN|7698|20-02-81|1600| 300|    30|
| 7521|  WARD|SALESMAN|7698|22-02-81|1250| 500|    30|
| 7654|MARTIN|SALESMAN|7698|28-09-81|1250|1400|    30|
| 7844|TURNER|SALESMAN|7698|08-09-81|1500|   0|    30|
+-----+------+--------+----+--------+----+----+------+

4

In [109]:
# how =all

data3 = data.na.drop( how = 'all')
data3.show()
data.count()

+-----+------+---------+----+--------+----+----+------+
|EMPNO| ENAME|      JOB| MGR|HIREDATE| SAL|COMM|DEPTNO|
+-----+------+---------+----+--------+----+----+------+
| 7369| SMITH|    CLERK|7902|17-12-80| 800|null|    20|
| 7499| ALLEN| SALESMAN|7698|20-02-81|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|22-02-81|1250| 500|    30|
| 7566| JONES|  MANAGER|7839|02-04-81|2975|null|    20|
| 7654|MARTIN| SALESMAN|7698|28-09-81|1250|1400|    30|
| 7698|   SGR|  MANAGER|7839|01-05-81|2850|null|    30|
| 7782|  RAVI|  MANAGER|7839|09-06-81|2450|null|    10|
| 7788| SCOTT|  ANALYST|7566|19-04-87|3000|null|    20|
| 7839|  KING|PRESIDENT|null|17-11-81|5000|null|    10|
| 7844|TURNER| SALESMAN|7698|08-09-81|1500|   0|    30|
| 7876| ADAMS|    CLERK|7788|23-05-87|1100|null|    20|
| 7900| JAMES|    CLERK|7698|03-12-81| 950|null|    30|
| 7902|  FORD|  ANALYST|7566|03-12-81|3000|null|    20|
| 7934|MILLER|    CLERK|7782|23-01-82|1300|null|    10|
| 1234|SEKHAR|   doctor|7777|    null| 667|  78|    80|
+-----+------+---------+----+--------+----+----+------+

15

In [111]:
#threshold 

data4= data.na.drop(how='any',thresh=2)
data4.show()
data4.count()

+-----+------+---------+----+--------+----+----+------+
|EMPNO| ENAME|      JOB| MGR|HIREDATE| SAL|COMM|DEPTNO|
+-----+------+---------+----+--------+----+----+------+
| 7369| SMITH|    CLERK|7902|17-12-80| 800|null|    20|
| 7499| ALLEN| SALESMAN|7698|20-02-81|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|22-02-81|1250| 500|    30|
| 7566| JONES|  MANAGER|7839|02-04-81|2975|null|    20|
| 7654|MARTIN| SALESMAN|7698|28-09-81|1250|1400|    30|
| 7698|   SGR|  MANAGER|7839|01-05-81|2850|null|    30|
| 7782|  RAVI|  MANAGER|7839|09-06-81|2450|null|    10|
| 7788| SCOTT|  ANALYST|7566|19-04-87|3000|null|    20|
| 7839|  KING|PRESIDENT|null|17-11-81|5000|null|    10|
| 7844|TURNER| SALESMAN|7698|08-09-81|1500|   0|    30|
| 7876| ADAMS|    CLERK|7788|23-05-87|1100|null|    20|
| 7900| JAMES|    CLERK|7698|03-12-81| 950|null|    30|
| 7902|  FORD|  ANALYST|7566|03-12-81|3000|null|    20|
| 7934|MILLER|    CLERK|7782|23-01-82|1300|null|    10|
| 1234|SEKHAR|   doctor|7777|    null| 667|  78|    80|
+-----+------+---------+----+--------+----+----+------+

15

In [112]:
#subset - used to delete particular column null values

data5 = data.na.drop(how= 'any',subset=["COMM"])
data5.show()
data5.count()

+-----+------+--------+----+--------+----+----+------+
|EMPNO| ENAME|     JOB| MGR|HIREDATE| SAL|COMM|DEPTNO|
+-----+------+--------+----+--------+----+----+------+
| 7499| ALLEN|SALESMAN|7698|20-02-81|1600| 300|    30|
| 7521|  WARD|SALESMAN|7698|22-02-81|1250| 500|    30|
| 7654|MARTIN|SALESMAN|7698|28-09-81|1250|1400|    30|
| 7844|TURNER|SALESMAN|7698|08-09-81|1500|   0|    30|
| 1234|SEKHAR|  doctor|7777|    null| 667|  78|    80|
+-----+------+--------+----+--------+----+----+------+

5

# filling null values

In [114]:
data.show()

+-----+------+---------+----+--------+----+----+------+
|EMPNO| ENAME|      JOB| MGR|HIREDATE| SAL|COMM|DEPTNO|
+-----+------+---------+----+--------+----+----+------+
| 7369| SMITH|    CLERK|7902|17-12-80| 800|null|    20|
| 7499| ALLEN| SALESMAN|7698|20-02-81|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|22-02-81|1250| 500|    30|
| 7566| JONES|  MANAGER|7839|02-04-81|2975|null|    20|
| 7654|MARTIN| SALESMAN|7698|28-09-81|1250|1400|    30|
| 7698|   SGR|  MANAGER|7839|01-05-81|2850|null|    30|
| 7782|  RAVI|  MANAGER|7839|09-06-81|2450|null|    10|
| 7788| SCOTT|  ANALYST|7566|19-04-87|3000|null|    20|
| 7839|  KING|PRESIDENT|null|17-11-81|5000|null|    10|
| 7844|TURNER| SALESMAN|7698|08-09-81|1500|   0|    30|
| 7876| ADAMS|    CLERK|7788|23-05-87|1100|null|    20|
| 7900| JAMES|    CLERK|7698|03-12-81| 950|null|    30|
| 7902|  FORD|  ANALYST|7566|03-12-81|3000|null|    20|
| 7934|MILLER|    CLERK|7782|23-01-82|1300|null|    10|
| 1234|SEKHAR|   doctor|7777|    null| 667|  78|    80|
+-----+------+---------+----+--------+----+----+------+

In [116]:
d1= data.fillna('Missing',['ENAME','JOB']).na.fill(1,['EMPNO','MGR','SAL','COMM','DEPTNO']).fillna('31-12-99',['HIREDATE'])
d1.show()

+-----+------+---------+----+--------+----+----+------+
|EMPNO| ENAME|      JOB| MGR|HIREDATE| SAL|COMM|DEPTNO|
+-----+------+---------+----+--------+----+----+------+
| 7369| SMITH|    CLERK|7902|17-12-80| 800|   1|    20|
| 7499| ALLEN| SALESMAN|7698|20-02-81|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|22-02-81|1250| 500|    30|
| 7566| JONES|  MANAGER|7839|02-04-81|2975|   1|    20|
| 7654|MARTIN| SALESMAN|7698|28-09-81|1250|1400|    30|
| 7698|   SGR|  MANAGER|7839|01-05-81|2850|   1|    30|
| 7782|  RAVI|  MANAGER|7839|09-06-81|2450|   1|    10|
| 7788| SCOTT|  ANALYST|7566|19-04-87|3000|   1|    20|
| 7839|  KING|PRESIDENT|   1|17-11-81|5000|   1|    10|
| 7844|TURNER| SALESMAN|7698|08-09-81|1500|   0|    30|
| 7876| ADAMS|    CLERK|7788|23-05-87|1100|   1|    20|
| 7900| JAMES|    CLERK|7698|03-12-81| 950|   1|    30|
| 7902|  FORD|  ANALYST|7566|03-12-81|3000|   1|    20|
| 7934|MILLER|    CLERK|7782|23-01-82|1300|   1|    10|
| 1234|SEKHAR|   doctor|7777|31-12-99| 667|  78|    80|
+-----+------+---------+----+--------+----+----+------+

# Filter operations

In [121]:
#salary of peeple greter than 1500 -one way

d1.filter('SAL>1500').show()

+-----+-----+---------+----+--------+----+----+------+
|EMPNO|ENAME|      JOB| MGR|HIREDATE| SAL|COMM|DEPTNO|
+-----+-----+---------+----+--------+----+----+------+
| 7499|ALLEN| SALESMAN|7698|20-02-81|1600| 300|    30|
| 7566|JONES|  MANAGER|7839|02-04-81|2975|   1|    20|
| 7698|  SGR|  MANAGER|7839|01-05-81|2850|   1|    30|
| 7782| RAVI|  MANAGER|7839|09-06-81|2450|   1|    10|
| 7788|SCOTT|  ANALYST|7566|19-04-87|3000|   1|    20|
| 7839| KING|PRESIDENT|   1|17-11-81|5000|   1|    10|
| 7902| FORD|  ANALYST|7566|03-12-81|3000|   1|    20|
+-----+-----+---------+----+--------+----+----+------+

In [134]:
#salary of peeple greter than 1500 -other way


d1.filter((col('SAL')>1500)).show()

+-----+-----+---------+----+--------+----+----+------+
|EMPNO|ENAME|      JOB| MGR|HIREDATE| SAL|COMM|DEPTNO|
+-----+-----+---------+----+--------+----+----+------+
| 7499|ALLEN| SALESMAN|7698|20-02-81|1600| 300|    30|
| 7566|JONES|  MANAGER|7839|02-04-81|2975|   1|    20|
| 7698|  SGR|  MANAGER|7839|01-05-81|2850|   1|    30|
| 7782| RAVI|  MANAGER|7839|09-06-81|2450|   1|    10|
| 7788|SCOTT|  ANALYST|7566|19-04-87|3000|   1|    20|
| 7839| KING|PRESIDENT|   1|17-11-81|5000|   1|    10|
| 7902| FORD|  ANALYST|7566|03-12-81|3000|   1|    20|
+-----+-----+---------+----+--------+----+----+------+

In [133]:
#not operator

d1.filter(~(col('SAL')>1500)).show()

+-----+------+--------+----+--------+----+----+------+
|EMPNO| ENAME|     JOB| MGR|HIREDATE| SAL|COMM|DEPTNO|
+-----+------+--------+----+--------+----+----+------+
| 7369| SMITH|   CLERK|7902|17-12-80| 800|   1|    20|
| 7521|  WARD|SALESMAN|7698|22-02-81|1250| 500|    30|
| 7654|MARTIN|SALESMAN|7698|28-09-81|1250|1400|    30|
| 7844|TURNER|SALESMAN|7698|08-09-81|1500|   0|    30|
| 7876| ADAMS|   CLERK|7788|23-05-87|1100|   1|    20|
| 7900| JAMES|   CLERK|7698|03-12-81| 950|   1|    30|
| 7934|MILLER|   CLERK|7782|23-01-82|1300|   1|    10|
| 1234|SEKHAR|  doctor|7777|31-12-99| 667|  78|    80|
+-----+------+--------+----+--------+----+----+------+

In [132]:
# & operator
#show empno,ename of people salary less than 1500 and comm should be greater than zero

d1.filter( (col('SAL')<1500) & (col('COMM')>0)).show()

+-----+------+--------+----+--------+----+----+------+
|EMPNO| ENAME|     JOB| MGR|HIREDATE| SAL|COMM|DEPTNO|
+-----+------+--------+----+--------+----+----+------+
| 7369| SMITH|   CLERK|7902|17-12-80| 800|   1|    20|
| 7521|  WARD|SALESMAN|7698|22-02-81|1250| 500|    30|
| 7654|MARTIN|SALESMAN|7698|28-09-81|1250|1400|    30|
| 7876| ADAMS|   CLERK|7788|23-05-87|1100|   1|    20|
| 7900| JAMES|   CLERK|7698|03-12-81| 950|   1|    30|
| 7934|MILLER|   CLERK|7782|23-01-82|1300|   1|    10|
| 1234|SEKHAR|  doctor|7777|31-12-99| 667|  78|    80|
+-----+------+--------+----+--------+----+----+------+

In [130]:
# | operator
d1.filter((col('SAL')<1500) | (col('COMM')>0)).show()

+-----+------+---------+----+--------+----+----+------+
|EMPNO| ENAME|      JOB| MGR|HIREDATE| SAL|COMM|DEPTNO|
+-----+------+---------+----+--------+----+----+------+
| 7369| SMITH|    CLERK|7902|17-12-80| 800|   1|    20|
| 7499| ALLEN| SALESMAN|7698|20-02-81|1600| 300|    30|
| 7521|  WARD| SALESMAN|7698|22-02-81|1250| 500|    30|
| 7566| JONES|  MANAGER|7839|02-04-81|2975|   1|    20|
| 7654|MARTIN| SALESMAN|7698|28-09-81|1250|1400|    30|
| 7698|   SGR|  MANAGER|7839|01-05-81|2850|   1|    30|
| 7782|  RAVI|  MANAGER|7839|09-06-81|2450|   1|    10|
| 7788| SCOTT|  ANALYST|7566|19-04-87|3000|   1|    20|
| 7839|  KING|PRESIDENT|   1|17-11-81|5000|   1|    10|
| 7876| ADAMS|    CLERK|7788|23-05-87|1100|   1|    20|
| 7900| JAMES|    CLERK|7698|03-12-81| 950|   1|    30|
| 7902|  FORD|  ANALYST|7566|03-12-81|3000|   1|    20|
| 7934|MILLER|    CLERK|7782|23-01-82|1300|   1|    10|
| 1234|SEKHAR|   doctor|7777|31-12-99| 667|  78|    80|
+-----+------+---------+----+--------+----+----+------+

# GroupBy and Aggregate functions

In [135]:
#GroupBy job role and max salary

data1.groupBy('JOB').sum('SAL').show()

+---------+--------+
|      JOB|sum(SAL)|
+---------+--------+
|  ANALYST|    6000|
| SALESMAN|    5600|
|    CLERK|    4150|
|  MANAGER|    8275|
|PRESIDENT|    5000|
|   doctor|     667|
+---------+--------+

In [137]:
#Group by of salaries

data1.groupBy('ENAME').sum('SAL').show(10)

+------+--------+
| ENAME|sum(SAL)|
+------+--------+
| JONES|    2975|
|SEKHAR|     667|
| ADAMS|    1100|
|TURNER|    1500|
|   SGR|    2850|
|  FORD|    3000|
|MILLER|    1300|
|  KING|    5000|
|  RAVI|    2450|
|MARTIN|    1250|
+------+--------+
only showing top 10 rows

In [138]:
#find max salary of person

data1.groupBy('ENAME').max('SAL').show()

+------+--------+
| ENAME|max(SAL)|
+------+--------+
| JONES|    2975|
|SEKHAR|     667|
| ADAMS|    1100|
|TURNER|    1500|
|   SGR|    2850|
|  FORD|    3000|
|MILLER|    1300|
|  KING|    5000|
|  RAVI|    2450|
|MARTIN|    1250|
| SCOTT|    3000|
| ALLEN|    1600|
|  WARD|    1250|
| JAMES|     950|
| SMITH|     800|
+------+--------+

In [139]:
#find job role and people count

data1.groupBy('JOB').count().show()

+---------+-----+
|      JOB|count|
+---------+-----+
|  ANALYST|    2|
| SALESMAN|    4|
|    CLERK|    4|
|  MANAGER|    3|
|PRESIDENT|    1|
|   doctor|    1|
+---------+-----+

In [140]:
#other way

data1.agg({'SAL':'sum'}).show()

+--------+
|sum(SAL)|
+--------+
|   29692|
+--------+